//Дано число больше 9. Вывести на экран  вторую цифру числа с конца
int a=4684;
int b=a/10; //отбрасывает последнюю цифру
int c=a%10; // остаток от деления на 10
System.Console.WriteLine(b);
System.Console.WriteLine(c);