//Вывести на экран четные числа от 1 до N
int i=1;
int N=50;
while(i<=N)
{
    if (i%2==0)
    {
        Console.Write($"{i} "); // вывод в строку с пробелами
    }
    i=i+1;
}