// Написать программу вычисления значения функции y = sin(a). (Класс Math)

double Sin(double x) //метод
{
    return Math.Sin(x);
}
double y=Sin(3.14);
System.Console.WriteLine(y);




//примеры
/*
double x,y;
x=Math.PI;
y=Math.Sin(x);
System.Console.WriteLine($"sin({x})={y}");

double Sum(double a, double b ) //метод
{
    return a+b;
}

void Pause() //метод
{
    System.Console.WriteLine("press any key");
}

double y=Sin(3,14) //метод
System.Console.WriteLine(y);
Pause();
*/
