//Вывести на экран числа от -N до N

int N=50;
int i=-N;
while(i<=N)
{
    Console.Write($"{i} "); // вывод в строку с пробелами
    i=i+1;
}
